results/1/server1/apiary-0.17.0/DEEP.log
Benchmarking DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.72ms    8.85ms 546.39ms   81.17%
    Req/Sec    14.37k     3.30k   25.11k    67.45%
  837290 requests in 30.00s, 97.42MB read
  Socket errors: connect 0, read 0, write 0, timeout 642
Requests/sec:  27909.26
Transfer/sec:      3.25MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.00ms   34.13ms   2.17s    99.91%
    Req/Sec    14.50k     2.99k   21.62k    68.11%
  847488 requests in 30.00s, 98.60MB read
  Socket errors: connect 0, read 0, write 0, timeout 21
Requests/sec:  28249.64
Transfer/sec:      3.29MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.72ms    9.62ms 706.32ms   86.55%
    Req/Sec    14.27k     2.81k   19.72k    70.39%
  836472 requests in 30.00s, 97.32MB read
  Socket errors: connect 0, read 0, write 0, timeout 254
Requests/sec:  27882.44
Transfer/sec:      3.24MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.40ms   15.81ms   1.61s    93.59%
    Req/Sec    14.04k     2.85k   19.12k    69.85%
  822024 requests in 30.00s, 95.64MB read
  Socket errors: connect 0, read 0, write 0, timeout 180
Requests/sec:  27400.59
Transfer/sec:      3.19MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.92ms   11.48ms 698.28ms   89.62%
    Req/Sec    13.89k     3.16k   25.63k    69.05%
  818108 requests in 30.01s, 95.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 138
Requests/sec:  27265.41
Transfer/sec:      3.17MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.79ms   50.85ms 694.08ms   99.31%
    Req/Sec    14.32k     4.44k   26.14k    66.01%
  827596 requests in 30.00s, 96.29MB read
  Socket errors: connect 0, read 0, write 0, timeout 286
Requests/sec:  27586.58
Transfer/sec:      3.21MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.94ms    9.25ms 836.10ms   90.82%
    Req/Sec    14.79k     2.67k   24.19k    68.97%
  874970 requests in 30.00s, 101.80MB read
  Socket errors: connect 0, read 0, write 0, timeout 46
Requests/sec:  29165.68
Transfer/sec:      3.39MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    28.19ms   26.66ms 806.75ms   99.68%
    Req/Sec    14.56k     4.44k   31.09k    75.41%
  851328 requests in 30.00s, 99.05MB read
  Socket errors: connect 0, read 0, write 0, timeout 543
Requests/sec:  28377.60
Transfer/sec:      3.30MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.63ms   11.46ms   1.20s    94.92%
    Req/Sec    14.99k     2.42k   21.19k    66.86%
  887507 requests in 30.00s, 103.26MB read
Requests/sec:  29583.29
Transfer/sec:      3.44MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    29.64ms    6.45ms 513.34ms   86.75%
    Req/Sec    13.97k     2.35k   17.02k    58.39%
  827892 requests in 30.00s, 96.32MB read
Requests/sec:  27596.08
Transfer/sec:      3.21MB
=================== summary ===================
machine:      server1
ghc version:  7.8.2
bench target: apiary-0.17.0
bench:        DEEP
bench mode:   30s * 10
average:      28101.66
stdev:        761.74
=================== oneline ===================
server1,7.8.2,apiary-0.17.0,DEEP,30s,10,28101.66,761.74